{
  "basics": {
    "firstName": "Jack",
    "lastName": "Klimov",
    "label": "Team Lead & Software Architect",
    "image": "assets/images/avatar.jpg",
    "email": "jaklimoff+cv@gmail.com",
    "phone": "+351 960 147 611",
    "url": "jaklimoff.com",
    "summary": "With over 14 years in the tech industry, my experience spans from Web 2.0 startups to gambling platforms and the cutthroat world of algo strategies and crypto MEV. Being an architect of software solutions and team leader, I always did my best to bring experience, leadership, and a hint of humor. My key attributes include passion for building projects from scratch, comprehensive understanding of the development cycle, and effective team management.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "Peniche",
      "countryCode": "PT",
      "country": "Portugal",
      "region": "Leiria"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "jaklimoff",
        "url": ""
      }
    ]
  },
  "work": [
    {
      "name": "Alt House",
      "location": "Remote",
      "position": "CTO / TeamLead",
      "url": null,
      "startDate": "2022-04-01",
      "endDate": "2024-04-01",
      "summary": "I donned the dual caps of a CTO and team lead, orchestrating a symphony of algorithmic strategies and MEV ventures in the lively concert of the crypto world.",
      "highlights": [
        "Steered the setup and upkeep of continuous integration/continuous deployment (CI/CD) pipelines, substantially enhancing the pace of development and the quality of code.",
        "Stayed at the forefront of blockchain technology, smart contracts, and DeFi trends, ensuring the company remained competitive and innovative.",
        "Ensured the architecture of the trading systems was scalable, secure, and resilient in the face of high-volume trading.",
        "Managed containerization and orchestration of services using technologies like Docker and Kubernetes to streamline deployment and scaling.",
        "Led a small, cross-functional agile team in creating and refining proper trading strategies",
        "Administered cloud infrastructures, leveraging tools like AWS, Google Cloud, and Azure, optimizing cost and performance.",
        "Fostered an organizational culture of agility, innovation, and constant learning specific to the crypto and financial tech landscape.",
        "Implemented robust monitoring and logging systems for improved observability and quicker incident resolution"
      ]
    },
    {
      "name": "ACT Commodities",
      "location": "Remote",
      "position": "Architect / TeamLead",
      "url": null,
      "startDate": "2019-02-01",
      "endDate": "2022-04-01",
      "summary": "In a fintech company, I started as the software architect and team leader, trying to sculpt digital marvels while juggling the joyous pandemonium of leading a team in the throbbing heart of financial wizardry.",
      "highlights": [
        "Led the implementation and maintenance of continuous integration/continuous deployment (CI/CD) pipelines, significantly improving development speed and code quality.",
        "Promoted DevOps culture within the organization, enhancing collaboration between development and operations teams.",
        "Pioneered the integration of cutting-edge technologies to improve system performance and user experience.",
        "Implemented optimization strategies for database queries to enhance performance.",
        "Guided team in understanding system architecture and promoted its consistent use across projects.",
        "Coordinated with project managers to ensure timely delivery of software project",
        "Designed and implemented sophisticated software architecture solutions for multiple projects."
      ]
    },
    {
      "name": "BuddhaSoft",
      "location": "Kyiv, Ukraine",
      "position": "CTO",
      "url": null,
      "startDate": "2016-05-01",
      "endDate": "2018-02-01",
      "summary": "As the CTO of a small outsource company I co-started with my friends, I found myself playing 'tech chess', strategizing and maneuvering, all while maintaining the camaraderie of a charmingly chaotic tech 'bromance'.",
      "highlights": [
        "Led the technological direction, strategy, and vision of the company, actively steering the implementation of cutting-edge solutions.",
        "Successfully collaborated with various internal and external stakeholders, including business leaders and clients to meet company objectives.",
        "Actively managed the organization's IT budget, ensuring efficient utilization of resources and return on technological investment.",
        "Consistently conducted interviews, hired developers, and assessed their performance effectively.\"",
        "Developed dozens of casino games with backend and frontend (Python, Go, JS)",
        "Crafted an online learning platform utilizing Python and Go."
      ]
    },
    {
      "name": "EvoPlay",
      "location": "Kyiv, Ukraine",
      "position": "TeamLead / Senior Developer",
      "url": null,
      "startDate": "2013-03-01",
      "endDate": "2016-05-01",
      "summary": "In the dynamic arena of another gambling company, I stepped up as the team lead, managing the roulette of project deadlines and pushing the chips of innovation forward.",
      "highlights": [
        "Create an architecture for highload game servers",
        "Async backend for social games",
        "Manage team members, assign tasks",
        "Build scalable casino platforms with help of django and tornado"
      ]
    },
    {
      "name": "CloneFish",
      "location": "Kyiv, Ukraine",
      "position": "Fullstack Developer",
      "url": null,
      "startDate": "2012-04-01",
      "endDate": "2013-03-01",
      "summary": "As a full-stack developer in a gambling company, I was not just dealing with Javascript or Python, I found myself 'betting' on lines of code and 'rolling the dice' on deployments, navigating the unpredictable world of software like a high-stakes poker game.",
      "highlights": [
        "Developed servers for social games in vk.com and ok.ru",
        "Extensive use of Tornado, Redis, and straight hands.",
        "Engaging directly with the project owner for communication.",
        "Designed and developed game engine in pixi.js from scratch"
      ]
    },
    {
      "name": "SimbirSoft",
      "location": "Remote",
      "position": "Fullstack Developer",
      "url": null,
      "startDate": "2007-06-01",
      "endDate": "2009-04-01",
      "summary": "As a full-stack developer, I juggled both back-end and front-end realms, masquerading as a software wizard who could conjure up solutions from thin air.",
      "highlights": [
        "Worked as fullstack developer on dozens of projects",
        "Got unique experience in communication with clients",
        "Developed backend using PHP and Python",
        "Developed frontend on JS and HTML/CSS"
      ]
    },
    {
      "name": "RotshildCo",
      "location": "Remote",
      "position": "System Administrator / PHP Developer",
      "url": null,
      "startDate": "2007-01-01",
      "endDate": "2009-01-01",
      "summary": "My first job. I was responsible for managing, maintaining, and troubleshooting the company's IT infrastructure.",
      "highlights": [
        "Developed universal system software to automate the clerical work in the company",
        "Creating and support the company website",
        "Installation and maintenance of all systems within a clients digital environment",
        "Obtaining quotes for supply of goods and services from suppliers"
      ]
    }
  ],
  "volunteer": [
  ],
  "education": [
    {
      "institution": "Saint Petersburg State Marine Technical University",
      "url": "https://institution.com/",
      "area": "Shipbuilding and Ocean Engineering",
      "courses": [],
      "studyType": "Bachelor",
      "startDate": "2007",
      "endDate": "2011"
    }
  ],
  "expertise": [
    {
      "title": "Rust",
      "summary": "My role involved incorporating Rust into our tech stack, which also included mentoring fellow developers on rust topics. I frequently used Actix and Rocket within my tasks. Additionally, I've had some exposure to Warp and Hyper."
    },
    {
      "title": "Python",
      "summary": "Skilled in building scalable, high-traffic Django API backends; proficient in data wrangling and statistical analysis using Pandas, along with constructing machine learning models through SciKit-Learn and TensorFlow."
    },
    {
      "title": "JavaScript/TypeScript",
      "summary": "Proficient in client-side programming with JavaScript and TypeScript, with hands-on experience in modern frameworks such as React, Angular."
    },
    {
      "title": "Kubernetes",
      "summary": "Experienced with K8s API, ecosystem and networking model, and adept at creating and managing CI/CD pipelines using Kubernetes and Docker."
    },
    {
      "title": "Cloud",
      "summary": "Big fan of AWS and GCP, but have a decent experience with Azure too."
    }
  ],
  "awards": [],
  "certificates": [],
  "publications": [],
  "skills": [
    {
      "name": "Web Development",
      "level": "Master",
      "keywords": [
        "HTML",
        "CSS",
        "JavaScript"
      ]
    }
  ],
  "languages": [
    {
      "language": "Russian",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Fluent"
    }
  ],
  "interests": [
    {
      "name": "Wildlife",
      "keywords": [
        "Unicorns"
      ]
    }
  ],
  "references": [],
  "projects": []
}
